## Staging: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 13 to add, 11 to change, 14 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.codedeploy_sns will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "codedeploy_sns" {
      - arn            = "arn:aws:sns:ca-central-1:687401027353:alert-warning" -> null
        id             = "alert-on-codedeploy-status-CodeDeploy_SNS"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.alb_ddos will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "alb_ddos" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "ALBDDoS"
      ~ ok_actions                = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.application_error_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "application_error_warn" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "ApplicationErrorWarn"
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_forms_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ddos_detected_forms_warn" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "DDoSDetectedformsWarn"
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_route53_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ddos_detected_route53_warn" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "DDoSDetectedRoute53Warn"
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.five_hundred_response_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "five_hundred_response_warn" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "500ResponseWarn"
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "forms_cpu_utilization_high_warn" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "CpuUtilizationWarn"
      ~ ok_actions                = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.forms_dead_letter_queue_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "forms_dead_letter_queue_warn" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "DeadLetterQueueWarn"
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "forms_memory_utilization_high_warn" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "MemoryUtilizationWarn"
      ~ ok_actions                = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.response_time_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "response_time_warn" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ]
        id                        = "ResponseTimeWarn"
      ~ ok_actions                = [
          + "",
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ]
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.route53_ddos will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
      ~ alarm_actions             = [
          + "",
          - "arn:aws:sns:us-east-1:687401027353:alert-warning",
        ]
        id                        = "Route53DDoS"
      ~ ok_actions                = [
          + "",
          - "arn:aws:sns:us-east-1:687401027353:alert-ok",
        ]
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_critical will be created
  + resource "aws_lambda_permission" "notify_slack_critical" {
      + action        = "lambda:InvokeFunction"
      + function_name = "NotifySlackSNS"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + statement_id  = "AllowExecutionFromSNSCriticalAlert"
    }

  # aws_lambda_permission.notify_slack_ok must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_ok" {
      ~ id            = "AllowExecutionFromSNSOkAlert" -> (known after apply)
      - source_arn    = "arn:aws:sns:ca-central-1:687401027353:alert-ok" -> null # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_ok_us_east must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_ok_us_east" {
      ~ id            = "AllowExecutionFromSNSOkAlertUSEast" -> (known after apply)
      - source_arn    = "arn:aws:sns:us-east-1:687401027353:alert-ok" -> null # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_warning must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_warning" {
      ~ id            = "AllowExecutionFromSNSWarningAlert" -> (known after apply)
      - source_arn    = "arn:aws:sns:ca-central-1:687401027353:alert-warning" -> null # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_warning_us_east must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_warning_us_east" {
      ~ id            = "AllowExecutionFromSNSWarningAlertUSEast" -> (known after apply)
      - source_arn    = "arn:aws:sns:us-east-1:687401027353:alert-warning" -> null # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic.alert_ok will be destroyed
  - resource "aws_sns_topic" "alert_ok" {
      - arn                         = "arn:aws:sns:ca-central-1:687401027353:alert-ok" -> null
      - content_based_deduplication = false -> null
      - fifo_topic                  = false -> null
      - id                          = "arn:aws:sns:ca-central-1:687401027353:alert-ok" -> null
      - kms_master_key_id           = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d" -> null
      - name                        = "alert-ok" -> null
      - owner                       = "687401027353" -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:Subscribe",
                          - "SNS:SetTopicAttributes",
                          - "SNS:RemovePermission",
                          - "SNS:Receive",
                          - "SNS:Publish",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:GetTopicAttributes",
                          - "SNS:DeleteTopic",
                          - "SNS:AddPermission",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - AWS:SourceOwner = "687401027353"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "SNS_Default_Policy"
                    },
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "*"
                      - Sid       = "SNS_Publish_statement"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                        = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_sns_topic.alert_ok_us_east will be destroyed
  - resource "aws_sns_topic" "alert_ok_us_east" {
      - arn                         = "arn:aws:sns:us-east-1:687401027353:alert-ok" -> null
      - content_based_deduplication = false -> null
      - fifo_topic                  = false -> null
      - id                          = "arn:aws:sns:us-east-1:687401027353:alert-ok" -> null
      - kms_master_key_id           = "arn:aws:kms:us-east-1:687401027353:key/6396cc01-7a02-47de-9bc1-4f810573812b" -> null
      - name                        = "alert-ok" -> null
      - owner                       = "687401027353" -> null
      - policy                      = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - AWS:SourceOwner = "687401027353"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:687401027353:alert-ok"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - tags                        = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_sns_topic.alert_warning will be destroyed
  - resource "aws_sns_topic" "alert_warning" {
      - arn                         = "arn:aws:sns:ca-central-1:687401027353:alert-warning" -> null
      - content_based_deduplication = false -> null
      - fifo_topic                  = false -> null
      - id                          = "arn:aws:sns:ca-central-1:687401027353:alert-warning" -> null
      - kms_master_key_id           = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d" -> null
      - name                        = "alert-warning" -> null
      - owner                       = "687401027353" -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:Subscribe",
                          - "SNS:SetTopicAttributes",
                          - "SNS:RemovePermission",
                          - "SNS:Receive",
                          - "SNS:Publish",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:GetTopicAttributes",
                          - "SNS:DeleteTopic",
                          - "SNS:AddPermission",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - AWS:SourceOwner = "687401027353"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "SNS_Default_Policy"
                    },
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "*"
                      - Sid       = "SNS_Publish_statement"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                        = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_sns_topic.alert_warning_us_east will be destroyed
  - resource "aws_sns_topic" "alert_warning_us_east" {
      - arn                         = "arn:aws:sns:us-east-1:687401027353:alert-warning" -> null
      - content_based_deduplication = false -> null
      - fifo_topic                  = false -> null
      - id                          = "arn:aws:sns:us-east-1:687401027353:alert-warning" -> null
      - kms_master_key_id           = "arn:aws:kms:us-east-1:687401027353:key/6396cc01-7a02-47de-9bc1-4f810573812b" -> null
      - name                        = "alert-warning" -> null
      - owner                       = "687401027353" -> null
      - policy                      = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - AWS:SourceOwner = "687401027353"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:687401027353:alert-warning"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - tags                        = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_sns_topic_policy.cloudwatch_events_critical_sns will be created
  + resource "aws_sns_topic_policy" "cloudwatch_events_critical_sns" {
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + AWS:SourceOwner = [
                                  + "687401027353",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_policy.cloudwatch_events_ok_sns must be replaced
-/+ resource "aws_sns_topic_policy" "cloudwatch_events_ok_sns" {
      - arn    = "arn:aws:sns:ca-central-1:687401027353:alert-ok" -> null # forces replacement
      ~ id     = "arn:aws:sns:ca-central-1:687401027353:alert-ok" -> (known after apply)
      ~ owner  = "687401027353" -> (known after apply)
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ AWS:SourceOwner = "687401027353" -> [
                                  + "687401027353",
                                ]
                            }
                        }
                        # (5 unchanged elements hidden)
                    },
                    {
                        Action    = "sns:Publish"
                        Effect    = "Allow"
                        Principal = {
                            Service = "events.amazonaws.com"
                        }
                        Resource  = "*"
                        Sid       = "SNS_Publish_statement"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

  # aws_sns_topic_policy.cloudwatch_events_warning_sns must be replaced
-/+ resource "aws_sns_topic_policy" "cloudwatch_events_warning_sns" {
      - arn    = "arn:aws:sns:ca-central-1:687401027353:alert-warning" -> null # forces replacement
      ~ id     = "arn:aws:sns:ca-central-1:687401027353:alert-warning" -> (known after apply)
      ~ owner  = "687401027353" -> (known after apply)
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ AWS:SourceOwner = "687401027353" -> [
                                  + "687401027353",
                                ]
                            }
                        }
                        # (5 unchanged elements hidden)
                    },
                    {
                        Action    = "sns:Publish"
                        Effect    = "Allow"
                        Principal = {
                            Service = "events.amazonaws.com"
                        }
                        Resource  = "*"
                        Sid       = "SNS_Publish_statement"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }

  # aws_sns_topic_subscription.topic_critical will be created
  + resource "aws_sns_topic_subscription" "topic_critical" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
    }

  # aws_sns_topic_subscription.topic_ok must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_ok" {
      ~ arn                             = "arn:aws:sns:ca-central-1:687401027353:alert-ok:6537d517-9d16-4f1f-9aab-6f5b0953a91d" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:687401027353:alert-ok:6537d517-9d16-4f1f-9aab-6f5b0953a91d" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - topic_arn                       = "arn:aws:sns:ca-central-1:687401027353:alert-ok" -> null # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_ok_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_ok_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:687401027353:alert-ok:a3badcf8-bda9-471b-9e74-d1d5eac9a72a" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:687401027353:alert-ok:a3badcf8-bda9-471b-9e74-d1d5eac9a72a" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - topic_arn                       = "arn:aws:sns:us-east-1:687401027353:alert-ok" -> null # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_warning must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_warning" {
      ~ arn                             = "arn:aws:sns:ca-central-1:687401027353:alert-warning:6953bf9d-51af-440b-a4ae-c955c152134c" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:687401027353:alert-warning:6953bf9d-51af-440b-a4ae-c955c152134c" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - topic_arn                       = "arn:aws:sns:ca-central-1:687401027353:alert-warning" -> null # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_warning_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_warning_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:687401027353:alert-warning:7ef8bc25-4ce7-483f-9c80-fdb930d80b96" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:687401027353:alert-warning:7ef8bc25-4ce7-483f-9c80-fdb930d80b96" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - topic_arn                       = "arn:aws:sns:us-east-1:687401027353:alert-warning" -> null # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 13 to add, 11 to change, 14 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]

10 tests, 8 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
